[
  {
    "id": 1,
    "jobTitle": "Senior Visualizer/Graphic Designer (Remote)",
    "location": "Remote (Global)",
    "companyOverview": "We are a fast-growing digital marketing agency specializing in the fintech and financial services sectors. We pride ourselves on delivering high-quality, visually striking content that resonates with our clients' audiences. We are looking for a creative, detail-oriented Senior Visualizer/Graphic Designer to join our team remotely. If you are passionate about design, have a keen eye for detail, and are skilled at transforming ideas into captivating visuals, we want to hear from you.",
    "positionOverview": "As a Senior Visualizer/Graphic Designer, you will be responsible for conceptualizing and designing visually compelling graphics, illustrations, and other creative assets. You will collaborate with our marketing, content, and development teams to ensure consistency in design and messaging across all platforms. This is a fully remote position, and you’ll be working closely with a dynamic team to create visual content that drives engagement and delivers results.",
    "keyResponsibilities": [
      "Creative Design & Conceptualization: Develop creative concepts, designs, and visual strategies for digital marketing campaigns, websites, social media, and presentations.",
      "Graphic Production: Design and produce high-quality graphics, illustrations, infographics, and other visual assets to support marketing and branding efforts.",
      "Brand Consistency: Ensure that all visual designs adhere to brand guidelines and maintain a consistent look and feel across all channels.",
      "Collaboration: Work closely with the marketing team, content creators, and other designers to create cohesive and engaging visual content for clients in the fintech and financial sectors.",
      "Project Management: Manage multiple design projects simultaneously, ensuring that deliverables meet deadlines and client expectations.",
      "Market Trends: Stay updated on the latest design trends and industry best practices to ensure the company’s creative output remains innovative and competitive."
    ],
    "dayToDayTasks": [
      "Visual Content Creation: Design banners, social media posts, landing pages, email templates, and other marketing materials.",
      "Brand Development: Assist in the creation and development of new brands, including logos, visual identities, and style guides.",
      "Feedback Iteration: Revise and improve design assets based on feedback from stakeholders and clients.",
      "Prototyping & Mockups: Create wireframes, mockups, and prototypes for new projects to present concepts before final design approval.",
      "File Management: Ensure that all design files are well-organized and easily accessible for the team."
    ],
    "requirements": {
      "experience": "Minimum of 4-5 years of professional experience in graphic design, preferably working remotely or in a digital-first environment.",
      "portfolio": "A strong portfolio showcasing a range of creative design work, including digital assets for web and social media.",
      "technicalSkills": [
        "Proficient in Adobe Creative Suite (Photoshop, Illustrator, InDesign) and other design software.",
        "Familiarity with web design tools such as Figma, Sketch, or Adobe XD is a plus.",
        "Strong understanding of typography, color theory, and layout design."
      ],
      "communication": "Excellent verbal and written communication skills in English. Ability to clearly present design ideas and concepts to team members and clients.",
      "attentionToDetail": "Highly detail-oriented with the ability to produce polished designs that meet the highest standards.",
      "adaptability": "Ability to work on multiple projects in a fast-paced, deadline-driven environment.",
      "creativeProblemSolving": "Ability to take creative briefs and turn them into fresh, impactful design solutions."
    },
    "niceToHave": [
      "Experience working with fintech, online trading brokers, or financial services clients.",
      "Motion graphics or video editing skills (After Effects, Premiere Pro).",
      "Understanding of UX/UI principles and web/mobile design."
    ],
    "benefits": [
      "Competitive salary based on experience.",
      "Fully remote position with flexible working hours.",
      "Opportunity to work with a global team and high-profile clients in the fintech space.",
      "Professional growth and development opportunities through training and collaboration."
    ]
  },
  {
    "id": 2,
    "jobTitle": "Online Business Development Manager (Remote)",
    "location": "Remote (Global)",
    "companyOverview": "We are a dynamic, fintech-specialized digital marketing agency providing cutting-edge marketing solutions to fintechs, online trading brokers, forex brokers, and financial services. Our goal is to drive strategic growth and brand visibility for our clients globally. We are expanding rapidly and are looking for a talented and motivated Business Development Manager to help us grow our client base and manage high-level sales.",
    "positionOverview": "We are seeking a skilled and experienced Online Business Development Manager to manage and scale our sales efforts. The ideal candidate has a strong background in B2B sales, particularly in selling SaaS products to international customers. This is a remote position, and you will be responsible for driving new business by engaging with C-suite executives and key decision-makers in fintech and financial services. You must be a go-getter with excellent communication skills and a strong understanding of digital marketing.",
    "keyResponsibilities": [
      "Lead Generation: Identify, qualify, and pursue business opportunities with fintechs, online trading brokers, forex brokers, and financial services.",
      "Client Engagement: Engage with CEOs, CCOs, CMOs, CTOs, Heads of Marketing, and COOs via online channels (LinkedIn, Instagram, email, and video conferencing).",
      "Sales Outreach: Develop personalized outreach strategies for prospecting and communicating value propositions, leveraging tools like LinkedIn Sales Navigator and CRM platforms.",
      "Proposal Development: Prepare and deliver compelling sales presentations, proposals, and contracts tailored to client needs.",
      "Relationship Management: Build and maintain strong relationships with clients through regular follow-ups, understanding their needs, and offering solutions that align with their goals.",
      "Sales Targets: Achieve monthly and quarterly sales targets, ensuring a healthy sales pipeline through consistent prospecting and follow-ups.",
      "Market Research: Stay up-to-date with industry trends, competitor analysis, and client challenges to adapt and refine sales strategies.",
      "Collaboration: Work closely with the marketing team to ensure alignment of messaging and campaign execution on LinkedIn and Instagram."
    ],
    "dayToDayTasks": [
      "Generate leads through proactive online research and social media engagement.",
      "Manage inbound and outbound sales efforts via online platforms.",
      "Set up and conduct virtual meetings and product demos with prospective clients.",
      "Utilize CRM software to manage leads, track communication, and close deals.",
      "Maintain regular contact with existing clients to encourage repeat business and upselling opportunities.",
      "Collaborate with internal teams to align sales efforts with marketing initiatives.",
      "Report on sales metrics and performance to senior management."
    ],
    "requirements": {
      "experience": "Minimum 2 years of proven experience in selling SaaS products to international customers, preferably in the fintech or financial services sectors.",
      "communication": "Exceptional proficiency in English, both written and verbal, with the ability to communicate complex ideas clearly and effectively.",
      "techSavvy": "Strong understanding of online sales tools and platforms, including CRM software, LinkedIn Sales Navigator, and marketing automation tools.",
      "goGetterAttitude": "Self-motivated, goal-oriented, and able to work independently in a remote environment.",
      "relationshipBuilding": "Ability to build rapport with senior executives and decision-makers.",
      "problemSolvingSkills": "Analytical mindset with the ability to understand client challenges and present tailored solutions.",
      "salesSkills": "Strong negotiation skills, with a focus on closing deals and achieving targets."
    },
    "niceToHave": [
      "Experience working in or selling to fintech, trading, or financial services companies.",
      "Familiarity with digital marketing strategies and tools."
    ],
    "benefits": [
      "Competitive salary and performance-based bonuses.",
      "Fully remote working environment with flexible working hours.",
      "Opportunity to work with a dynamic team and grow within a fast-paced industry.",
      "Access to top-tier sales tools and resources to support your success."
    ]
  },
  {
    "id": 3,
    "jobTitle": "SEO Specialist (Remote)",
    "location": "Remote (Global)",
    "companyOverview": "We are a forward-thinking digital marketing agency with a strong focus on the fintech and financial services sectors. We help our clients boost their online presence and achieve measurable results through tailored digital strategies. We are seeking a knowledgeable and results-driven SEO Specialist to join our remote team and take ownership of driving organic growth for our clients.",
    "positionOverview": "As an SEO Specialist, you will be responsible for developing and executing SEO strategies that increase our clients’ organic search visibility, drive traffic, and improve conversion rates. You will work closely with our content, web development, and marketing teams to ensure that SEO best practices are integrated into every aspect of our digital campaigns. This role requires a deep understanding of current SEO trends, technical SEO, and content optimization.",
    "keyResponsibilities": [
      "SEO Strategy Development: Create and implement comprehensive SEO strategies to increase organic traffic and search rankings for clients in fintech, trading, and financial services.",
      "Keyword Research: Conduct extensive keyword research to identify target keywords that drive traffic and conversions for our clients.",
      "On-Page SEO: Optimize website pages, landing pages, blog posts, and other digital assets for search engines, ensuring proper use of title tags, meta descriptions, headers, and internal linking structures.",
      "Off-Page SEO: Build and execute backlink strategies, including outreach for guest posting and collaboration opportunities to boost domain authority.",
      "Technical SEO: Perform regular site audits to identify and resolve technical issues related to crawling, indexing, site speed, and mobile responsiveness.",
      "Content Optimization: Collaborate with content creators to ensure that all content is SEO-friendly, focusing on keyword density, readability, and user engagement.",
      "Analytics & Reporting: Track, analyze, and report on SEO performance metrics, including traffic, rankings, conversions, and ROI, using tools like Google Analytics, Search Console, and SEMrush.",
      "Competitor Analysis: Regularly assess competitors’ SEO strategies to identify opportunities for improvement and differentiation."
    ],
    "dayToDayTasks": [
      "Monitor keyword rankings and adjust strategies to improve performance.",
      "Conduct regular website audits and provide actionable insights to improve SEO performance.",
      "Research trending keywords and long-tail opportunities relevant to client industries.",
      "Work with web developers to implement technical fixes and site improvements.",
      "Analyze search behavior and user intent to guide content strategy and optimization.",
      "Collaborate with the marketing team on SEO-optimized campaigns, blogs, and web pages.",
      "Stay updated on the latest SEO trends, algorithm changes, and best practices."
    ],
    "requirements": {
      "experience": "Minimum of 3 years of experience in SEO, with a proven track record of improving organic search rankings and driving traffic.",
      "technicalSkills": [
        "Proficiency in SEO tools like Google Analytics, Google Search Console, SEMrush, Ahrefs, and Screaming Frog.",
        "Strong understanding of technical SEO, including site architecture, URL structures, and page speed optimization.",
        "Experience with on-page SEO, content optimization, and backlink strategy."
      ],
      "analyticalSkills": "Ability to interpret data, analyze website performance, and identify actionable insights to improve SEO.",
      "knowledgeOfAlgorithms": "Up-to-date knowledge of Google algorithms, ranking factors, and search engine behaviors.",
      "contentOptimization": "Understanding of how content marketing and SEO work together to drive organic growth.",
      "communication": "Excellent written and verbal communication skills to clearly convey SEO recommendations and strategies to clients and internal teams."
    },
    "niceToHave": [
      "Experience with SEO for fintech, trading, or financial services websites.",
      "Basic understanding of HTML, CSS, and JavaScript to implement SEO recommendations.",
      "Knowledge of UX/UI principles and how they impact SEO performance."
    ],
    "benefits": [
      "Competitive salary based on experience.",
      "Fully remote position with flexible working hours.",
      "Opportunity to work with a global team and clients in cutting-edge industries.",
      "Access to advanced SEO tools and platforms to enhance performance.",
      "Professional growth and continuous learning opportunities."
    ]
  },
  {
    "id": 4,
    "jobTitle": "Digital Marketing Specialist (Remote)",
    "location": "Remote (Global)",
    "companyOverview": "We are a fintech-focused digital marketing agency delivering innovative marketing solutions to clients in the online trading, forex, and financial services sectors. We are looking for a creative, data-driven Digital Marketing Specialist to join our remote team. This role is ideal for someone who thrives in a fast-paced environment and is passionate about executing high-performing digital campaigns.",
    "positionOverview": "As a Digital Marketing Specialist, you will play a key role in developing, executing, and optimizing digital marketing strategies across multiple platforms to drive growth and engagement for our clients. You will be responsible for managing paid advertising campaigns, SEO, content marketing, and email marketing. Your goal is to improve visibility, generate leads, and increase conversions through data-backed strategies.",
    "keyResponsibilities": [
      "Paid Advertising Campaigns: Plan, execute, and optimize paid campaigns across platforms such as Google Ads, Facebook, LinkedIn, and Instagram to drive traffic and conversions.",
      "SEO & Content Marketing: Collaborate with SEO and content teams to ensure digital content is optimized for search engines, focusing on organic growth and visibility.",
      "Social Media Marketing: Develop and implement social media strategies, creating engaging content to build and nurture client audiences across LinkedIn, Instagram, Twitter, and other platforms.",
      "Email Marketing: Design and manage email marketing campaigns, focusing on lead nurturing, client retention, and conversion optimization.",
      "Data Analysis & Reporting: Track and analyze campaign performance using tools like Google Analytics, social media analytics, and marketing dashboards to provide actionable insights and recommendations for improvement.",
      "Lead Generation & Conversion Optimization: Work on improving landing pages, A/B testing, and optimizing conversion funnels to boost lead generation and client acquisition.",
      "Collaborate with Clients: Work directly with clients to understand their marketing goals, challenges, and create tailored digital marketing strategies that align with their objectives.",
      "Stay Updated on Industry Trends: Keep abreast of the latest digital marketing trends, tools, and technologies to ensure our strategies are cutting-edge and effective."
    ],
    "dayToDayTasks": [
      "Set up and manage digital ad campaigns on Google, Facebook, and other relevant platforms.",
      "Track and optimize the performance of ongoing campaigns to maximize ROI.",
      "Create social media content calendars, posts, and ad creatives.",
      "Conduct keyword research and collaborate with the SEO team to improve search engine rankings.",
      "Analyze website traffic and user behavior to recommend improvements for better conversions.",
      "Run A/B tests on landing pages and ad copy to optimize campaign results.",
      "Generate weekly/monthly reports on digital marketing performance and provide actionable insights.",
      "Coordinate with clients and internal teams to ensure that digital marketing campaigns align with overall business goals."
    ],
    "requirements": {
      "experience": "Minimum of 3 years of experience in digital marketing, with a proven track record of managing paid campaigns and driving results.",
      "technicalSkills": [
        "Expertise in paid platforms such as Google Ads, Facebook Ads, LinkedIn Ads, and Instagram.",
        "Familiarity with tools like Google Analytics, SEMrush, HubSpot, and other marketing automation platforms.",
        "Experience with email marketing tools like Mailchimp or ActiveCampaign.",
        "Strong understanding of SEO principles, keyword research, and on-page/off-page optimization.",
        "Ability to design and implement conversion rate optimization (CRO) strategies."
      ],
      "analyticalSkills": "Strong ability to interpret data, generate insights, and optimize campaigns for better performance.",
      "creativeStrategicThinking": "Ability to think outside the box when crafting creative campaigns while staying aligned with business objectives.",
      "communication": "Excellent written and verbal communication skills, with the ability to present data-driven strategies and results to clients and team members."
    },
    "niceToHave": [
      "Experience in digital marketing for fintech, trading, or financial services.",
      "Knowledge of design tools such as Canva or Adobe Creative Suite to create ad graphics.",
      "Basic knowledge of HTML/CSS for email or landing page customization."
    ],
    "benefits": [
      "Competitive salary with performance-based bonuses.",
      "Fully remote position with flexible working hours.",
      "Opportunity to work on high-impact campaigns for leading fintech and financial services brands.",
      "Access to top-tier marketing tools and training to support your growth.",
      "Collaborative, fast-paced work environment with a global team."
    ]
  },
  {
    "id": 5,
    "jobTitle": "Video Editor (Remote)",
    "location": "Remote (Global)",
    "companyOverview": "We are a dynamic digital marketing agency specializing in fintech, online trading, and financial services. Our mission is to deliver high-quality, engaging content that captures the attention of audiences and drives results for our clients. We are looking for a talented Video Editor to join our remote team. If you have a passion for storytelling through video and thrive in a fast-paced environment, this role is for you.",
    "positionOverview": "As a Video Editor, you will be responsible for creating, editing, and producing engaging video content for various digital platforms, including social media, websites, and marketing campaigns. You’ll work closely with the creative and marketing teams to ensure videos align with client objectives, brand guidelines, and visual standards. This is a fully remote position, and you’ll have the flexibility to work with a global team on high-impact projects.",
    "keyResponsibilities": [
      "Video Editing & Post-Production: Edit raw footage into compelling, high-quality videos that align with the brand’s messaging and visual style.",
      "Storytelling & Visual Impact: Craft engaging narratives through creative video editing techniques, including transitions, graphics, and special effects.",
      "Content Creation: Develop video content for social media platforms (Instagram, LinkedIn, YouTube), digital ads, product demos, and promotional campaigns.",
      "Collaboration: Work closely with content creators, designers, and marketers to understand the project scope and deliver impactful visual content.",
      "Video Optimization: Optimize video content for different platforms, ensuring correct formats, aspect ratios, and quality standards are met (4K, HD).",
      "Sound & Music Editing: Incorporate sound design, voice-overs, and background music into videos, ensuring smooth integration and professional audio quality.",
      "Versioning & Revisions: Produce multiple versions of video content to suit various platforms, target audiences, and campaign requirements.",
      "File Management: Organize and manage video files, ensuring all assets are labeled, stored, and easily accessible."
    ],
    "dayToDayTasks": [
      "Edit video content using software like Adobe Premiere Pro, Final Cut Pro, or DaVinci Resolve.",
      "Add graphics, animations, transitions, and effects to videos for enhanced visual appeal.",
      "Sync video with audio elements, adjust color grading, and perform final rendering.",
      "Collaborate with the creative and marketing teams on new video concepts and formats.",
      "Ensure all videos are optimized for each platform (e.g., YouTube, Instagram Stories, LinkedIn).",
      "Implement feedback from team members and clients to revise and improve video content.",
      "Stay updated with video editing trends, tools, and techniques to ensure cutting-edge content production."
    ],
    "requirements": {
      "experience": "Minimum of 3 years of professional experience in video editing and post-production, with a proven portfolio of work.",
      "technicalSkills": [
        "Proficiency in video editing software such as Adobe Premiere Pro, Final Cut Pro, or DaVinci Resolve.",
        "Experience with motion graphics and animation tools like After Effects.",
        "Knowledge of video formats, codecs, and file delivery standards.",
        "Strong understanding of sound design, color correction, and visual effects."
      ],
      "creativityStorytelling": "A keen eye for storytelling, pacing, and creating engaging narratives through video.",
      "timeManagement": "Ability to manage multiple projects at once, meet deadlines, and work under pressure.",
      "communication": "Excellent communication skills to collaborate with remote teams and understand project goals and feedback.",
      "attentionToDetail": "High level of attention to detail, ensuring each video aligns with client expectations and brand guidelines."
    },
    "niceToHave": [
      "Experience creating video content for fintech, trading, or financial services industries.",
      "Familiarity with social media platform requirements for video (Instagram Stories, YouTube, etc.).",
      "Basic knowledge of 3D modeling or motion design tools."
    ],
    "benefits": [
      "Competitive salary with opportunities for bonuses based on performance.",
      "Fully remote role with flexible working hours.",
      "Opportunity to work on high-visibility projects for global clients.",
      "Access to the latest video editing software and tools.",
      "Collaborative, creative work environment with a global team."
    ]
  },
  {
    "id": 6,
    "jobTitle": "Content Writer (Remote)",
    "location": "Remote (Global)",
    "companyOverview": "We are a fast-growing digital marketing agency specializing in fintech, online trading, and financial services. We create high-quality, targeted content that helps our clients connect with their audience and grow their business. We are looking for a skilled Content Writer to join our remote team. If you are passionate about writing, have a keen understanding of the financial industry, and excel at producing engaging content, we’d love to hear from you.",
    "positionOverview": "As a Content Writer, you will be responsible for creating compelling, well-researched, and SEO-optimized content that resonates with our target audiences. You will work closely with the marketing, SEO, and design teams to produce blog posts, articles, website content, social media copy, and more. This role is ideal for a talented writer with a passion for fintech, finance, and digital marketing who can manage multiple projects in a fast-paced environment.",
    "keyResponsibilities": [
      "Content Creation: Write engaging, informative, and original content for blogs, websites, email newsletters, social media, and other digital platforms.",
      "SEO Optimization: Collaborate with the SEO team to ensure that content is optimized for search engines, focusing on keyword integration, readability, and user intent.",
      "Research & Analysis: Conduct in-depth research on topics related to fintech, online trading, and financial services to produce accurate and authoritative content.",
      "Content Strategy: Work with the marketing team to develop content strategies that align with clients’ goals and target audiences.",
      "Editing & Proofreading: Review and edit content for grammar, tone, style, and accuracy, ensuring all content meets high editorial standards.",
      "Collaboration: Work closely with designers and video producers to ensure content is visually appealing and aligns with the brand’s voice and style.",
      "Market Trends: Stay updated on the latest trends and developments in fintech, finance, and digital marketing to create timely, relevant content."
    ],
    "dayToDayTasks": [
      "Write and edit blog posts, articles, case studies, white papers, and web copy.",
      "Optimize written content for SEO to improve search rankings and organic traffic.",
      "Conduct thorough research on industry-specific topics and trends.",
      "Brainstorm content ideas with the marketing team and contribute to content calendars.",
      "Proofread and revise content to ensure clarity, tone, and adherence to brand guidelines.",
      "Collaborate with the design team to create visually engaging content."
    ],
    "requirements": {
      "experience": "Minimum of 2-3 years of professional writing experience, preferably within fintech, financial services, or digital marketing.",
      "writingSkills": "Strong writing, editing, and proofreading skills with a focus on producing clear, concise, and compelling content.",
      "seoKnowledge": "Experience with SEO writing and understanding of keyword research, search intent, and best practices for content optimization.",
      "researchSkills": "Ability to conduct thorough research and translate complex topics into easily digestible, engaging content.",
      "creativity": "Ability to create engaging stories and narratives that capture audience attention while aligning with the brand’s voice.",
      "timeManagement": "Excellent organizational and time management skills, with the ability to manage multiple content projects simultaneously and meet deadlines.",
      "communication": "Strong collaboration skills, with the ability to communicate effectively with cross-functional teams and stakeholders."
    },
    "niceToHave": [
      "Experience writing content for fintech, trading, or financial services industries.",
      "Familiarity with content management systems (CMS) such as WordPress.",
      "Experience writing for different formats, including video scripts, infographics, and social media campaigns."
    ],
    "benefits": [
      "Competitive salary based on experience.",
      "Fully remote position with flexible working hours.",
      "Opportunity to work on impactful projects with global clients in the fintech space.",
      "Professional growth and development opportunities, including training in SEO and digital marketing.",
      "Collaborative, creative team environment with a focus on innovation and quality."
    ]
  }
]
